module.exports = {
    "tabWidth": 4, // величина отступа в пробелах
    "useTabs": false, // использовать символ табуляции для отступа
    "printWidth": 100, // максимальная длина строки
    "semi": true, // точки с запятой в конце операторов
    "singleQuote": true, // одинарные ковычки
    "trailingComma": "es5", // "висящая" запятая
    "bracketSpacing": false, // установка пробелов между скобками в объектах
    "arrowParens": "always", // оборачивание в круглые скобки единственного параметра в стелочной функции
    "endOfLine": "auto" //
}
